#использовать "../src"
#Использовать asserts
#Использовать logos

Перем юТест;

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт

	юТест = Тестирование;

	ИменаТестов = Новый Массив;

	ИменаТестов.Добавить("ТестДолжен_ПроверитьРаботуКласса");


	Возврат ИменаТестов;

КонецФункции

Процедура ТестДолжен_ПроверитьРаботуКласса() Экспорт

	jwt = новый jwt;
	КлючШифрования = "secret";
	ДанныеКлюча = Новый Структура;
	ДанныеКлюча.Вставить("sub", "1234567890");
	ДанныеКлюча.Вставить("name", "John Doe");
	ДанныеКлюча.Вставить("admin", True);
	
	Токен = jwt.Кодировать(КлючШифрования, ДанныеКлюча);
	
	РасшифрованныеДанные = jwt.Декодировать(Токен, КлючШифрования);

	Ожидаем.Что(РасшифрованныеДанные.sub, "Расшифрованные данные sub должны совпадать").Равно(ДанныеКлюча.sub);
	Ожидаем.Что(РасшифрованныеДанные.name, "Расшифрованные данные name должны совпадать").Равно(ДанныеКлюча.name);
	Ожидаем.Что(РасшифрованныеДанные.admin, "Расшифрованные данные sub должны совпадать").Равно(ДанныеКлюча.admin);

КонецПроцедуры




